---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.#ctor(Autodesk.Revit.DB.Color,System.Double)
source: html/5e60ad79-d0fb-f3c8-5e28-91c14e12d8b1.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.#ctor Method

Constructs a color entry with a specific value assigned.

## Syntax (C#)
```csharp
public AnalysisDisplayColorEntry(
	Color color,
	double value
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color`) - Color assigned to the entry.
- **value** (`System.Double`) - Value assigned to the entry.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null